#include<stdio.h>
#include<stdlib.h>
int main(int argc, char const *argv[])
{
  int a = 30, x;
  ///////条件付き代入//////
  // x = (条件) ? a : b --> a:条件がTrueの時の値, b:条件がFalseの時の値//
  x = (0 <= a && a <= 100) ? a : 0;   // True--> x = a , False--> x = b //
  printf("%d\n", x);
  return 0;
}

/******************************************************************
/  && : かつ   　   : (a >= 10) && (a < 50)  : aは10以上かつ50未満
/  || : または  　  : (a == 1) || (a == 100) : aの値が1か100
/  !  : ～ではない  : !(a == 100)            : aは100ではない       
/
*******************************************************************/
